# cask 'android-platform-tools' # includes adb
# cask 'android-studio'
# cask 'balenaetcher'
cask 'nikitabobko/tap/aerospace'
cask 'bitwarden'
cask 'docker'
# cask 'figma'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite-no-mail'
cask 'hammerspoon'
cask 'karabiner-elements'
# cask 'kindle'
cask 'kitty'
cask 'logi-options-plus'
cask 'obsidian'
# cask 'openemu'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'spotify'
# cask 'subler'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

brew 'aescrypt-packetizer'
brew 'atuin'
brew 'bat' # syntax highlighting for cat
brew 'bitwarden-cli'
brew 'caddy' # might need to run caddy trust
brew 'chrome-cli'
brew 'clojure/tools/clojure'
brew 'cmake'
brew 'eza' # highlighting and icons for ls
brew 'fd' # fast file searching
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'git-delta'
brew 'git-who'
brew 'jq'
brew 'yq'
brew 'libpq'
brew 'neovim'
brew 'nss' # used with caddy so it has access to certutil for localhost domains
brew 'openjdk'
brew 'pipx' # used for pipx install posting
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'reattach-to-user-namespace' # copy and paste in tmux
brew 'shfmt'
brew 'sleek' # formatting sql
brew 'tldr' # tldr of the man pages
brew 'tree'
brew 'tmux'
brew 'wget'

cask 'font-droid-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
