tap 'homebrew/cask'
cask 'alfred' 
# cask 'android-platform-tools' # includes adb
# cask 'android-studio'
# cask 'balenaetcher'
cask 'bitwarden'
cask 'docker' # this is docker desktop, with colima just need the executable
cask 'figma'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite-no-mail'
# cask 'graphiql'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'kindle'
cask 'kitty'
# cask 'linear-linear'
# cask 'mongodb-compass'
cask 'ngrok'
cask 'notion'
cask 'openemu'
cask 'postman'
cask 'slack'
# cask 'sourcetree'
cask 'spotify'
cask 'tableplus'
# cask 'visual-studio-code'
# cask 'virtualbox'
cask 'zoom'

brew 'bat' # syntax highlighting for cat
brew 'bitwarden-cli'
brew 'cmake'
brew 'derailed/k9s/k9s'
brew 'gawk'
# brew 'colima'
# brew 'docker'
brew 'exa' # highlighting and icons for ls
brew 'fd' # fast file searching
brew 'fzf'
brew 'gh'
brew 'go'
# brew 'golangci-lint'
brew 'jq'
brew 'yq'
brew 'kind'
brew 'kubectx'
brew 'neovim'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'reattach-to-user-namespace' # copy and paste in tmux
brew 'tldr' # tldr of the man pages
brew 'tree'
brew 'tmux'
brew 'wget'

tap 'homebrew/cask-fonts'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
